[
    {
        "name": "Lower-Division Requirements (24 units):",
        "child": [
            {
                "name": "A. Complete the following Research Methods and Data Literacy Requirement (8 units)",
                "child": [
                    "EDUC 10",
                    "EDUC 15"
                ]
            },
            {
                "name": "B. Complete the following Introduction to Education Science Requirement (16 units)",
                "child": [
                    "EDUC 25",
                    "EDUC 30",
                    "EDUC 40",
                    "EDUC 50"
                ]
            }
        ]
    },
    {
        "name": "Upper-Division Requirements (20 units):",
        "child": [
            {
                "name": "C. Select one Human Development course (4 units):",
                "child": [
                    "EDUC 107",
                    "EDUC 108"
                ]
            },
            {
                "name": "D. Select one Learning course (4 units):",
                "child": [
                    "EDUC 146",
                    "EDUC 173"
                ]
            },
            {
                "name": "E. Select one Social Structures and Stratification course (4 units):",
                "child": [
                    "EDUC 124",
                    "EDUC 147"
                ]
            },
            {
                "name": "F. Select one Policymaking in Education course (4 units):",
                "child": [
                    "EDUC 142",
                    "EDUC 140"
                ]
            },
            {
                "name": "G. Select one Schools as Organizations course (4 units):",
                "child": [
                    "EDUC 144",
                    "EDUC 150"
                ]
            },
            {
                "name": "H. Five additional elective Education courses (20 units). At least 12 units must be upper-division (numbered 100-199).",
                "child": []
            },
            {
                "name": "The additional electives do not include the following professional education courses: EDUC 109, EDUC 143AW, EDUC 143BW, EDUC 148, EDUC 158. A maximum of 8 units for any repeatable Education course (e.g., EDUC 198, EDUC 199) may be used to satisfy this elective requirement.",
                "child": []
            },
            {
                "name": "I. Practicum Requirement (40 hours total):",
                "child": []
            },
            {
                "name": "A minimum of 40 hours of field experience or research in an education setting, satisfied in the following manner:",
                "child": []
            },
            {
                "name": "Complete 40 hours of field experience or research completed in conjunction with one or more  approved UCI courses that include a practicum. Consult the Education Student Affairs Office or School of Education website for Undergraduate Academic Programs for a current list of approved practicum courses.",
                "child": []
            }
        ]
    }
]