[
    {
        "name": "Emphasis in Chinese Language and Literature",
        "child": [
            {
                "name": "(b) A. Complete:",
                "child": [
                    "CHINESE 3C"
                ]
            },
            {
                "name": "(b) B. Complete:",
                "child": [
                    "CHINESE 100A",
                    "CHINESE 100B",
                    "CHINESE 100C"
                ]
            },
            {
                "name": "(b) C. Complete:",
                "child": [
                    "EAS 15C",
                    "EAS 190"
                ]
            },
            {
                "name": "(b) D. Select one upper-division course dealing with the literature or culture of another East Asian country.",
                "child": []
            },
            {
                "name": "(b) E. Select five additional courses in Chinese literature, history, art history, linguistics, professional Chinese, comparative literature, film and media, religion, gender studies, or philosophy, of which two may be lower-division courses offered by the East Asian Studies department.",
                "child": []
            }
        ]
    },
    {
        "name": "Emphasis in Chinese Culture and Society",
        "child": [
            {
                "name": "(b) A. Complete:",
                "child": [
                    "CHINESE 2C"
                ]
            },
            {
                "name": "Or equivalent.",
                "child": []
            },
            {
                "name": "(b) B. Complete:",
                "child": [
                    "HISTORY 171D",
                    "HISTORY 171E"
                ]
            },
            {
                "name": "(b) C. Complete:",
                "child": [
                    "EAS 15C",
                    "EAS 190"
                ]
            },
            {
                "name": "(b) D. Select three upper-division courses on China offered by the Department.",
                "child": []
            },
            {
                "name": "(b) E. Select two approved upper-division courses dealing with the literature, religion, culture, history, or society of another East Asian country.",
                "child": []
            },
            {
                "name": "(b) F. Select two approved upper-division courses in the School of Social Sciences dealing with China.",
                "child": []
            },
            {
                "name": "(b) G. Select two additional courses in Chinese language, literature, history, art history, linguistics, professional Chinese, comparative literature, film and media, religion, gender studies, or philosophy, of which one or both may be lower-division courses offered by the East Asian Studies Department. (Courses from the School of Social Sciences may be substituted with departmental approval by petition.)",
                "child": []
            }
        ]
    }
]